Catalogs/КонтактЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>КонтактЦентры</Name>
			<Comment>Контакт-центры</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Comment>Очередь контакт-центра. Используется для определения состояния паузы телефона (в очереди)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение к которому относится контакт-центр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКаскадОчередей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПочтовыеФильтры</Name>
					<Comment>Правила, в соответствии с которыми входящие почтовые сообщения помещаются в список контроля для данного контакт-центра</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Почтовый адрес или имя сервера отправителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Comment>Принадлежность адреса к подразделению</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Список пользователей - сотрудников контакт-центра</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь - сотрудник контакт-центра</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПанельСостав</Name>
					<Comment>Состав панели быстрого вызова</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Подпись к кнопке быстрого вызова</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Comment>Телефон или очередь для быстрого вызова</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
								<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КаскадОчередей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрабатыватьАвтозвонок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Comment>Флаг активности пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Местонахождение группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
					<Comment>Учетная запись информационной базы с которой олицетворен пользователь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПараметр</Name>
					<Comment>Параметр аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Comment>Тип аутентификации пользователя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Comment>Используется в бизнес-процессе "Обратная связь лояльности" для постановки и отбора задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииПоказыватьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
					<Comment>Полномочия пользователя</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Доступные подразделения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Доступ к иерархии подразделения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
					<Comment>Целевые точки, которые доступны дополнительно, не зависимо от достуных подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОбщиеОчереди</Name>
					<Comment>Очереди, не привязанные к целевым точкам, но включающие агентов целевых звонков (общие очереди)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтактЦентры/Forms/ФормаГруппы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Настроим отбор для списка "Панели"
//-------------------------------------------------------------------------------------------------
	ЭтаФорма.Панели.Параметры.УстановитьЗначениеПараметра("ЭтотОбъект",Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения()

// Доступность страницы "Панели"
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.СтраницаПанели.Видимость = Доступно;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Объект.Ссылка,ЭтаФорма);
	ПриСозданииНаСервере(Ложь,Истина);
	ПриОткрытии(Ложь);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение,ИсточникВыбора)

// В зависимости от типа выбранного значения выполним различные процедуры
//-------------------------------------------------------------------------------------------------
	Если (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи")) Тогда
		ОбработкаВыбораПользователь(ВыбранноеЗначение);
	ИначеЕсли (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Предприятие")) Тогда
		Результат = ОбработкаВыбораПредприятие(ВыбранноеЗначение);
	Иначе
		Результат = "Обработка значения выбранного типа не поддерживается";
	КонецЕсли;

// Если функция обработки вернула непустой "Результат", то выведем сообщение с текстом результата
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Результат)) Тогда
		Предупреждение(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПользователь(ВыбранноеЗначение)

// Проверим ВыбранноеЗначение на наличие в ТЧ "Пользователи"
//-------------------------------------------------------------------------------------------------
	Фильтр = Новый Структура;
	Фильтр.Вставить("Пользователь",ВыбранноеЗначение);
	Результат = Объект.Пользователи.НайтиСтроки(Фильтр);
	Ответ = "";

	Если (Результат.Количество() > 0) Тогда
		Ответ = "Выбранный пользователь уже присутствует в списке сотрудников контакт-центра";
	Иначе
		НовСтрока = Объект.Пользователи.Добавить();
		НовСтрока.Пользователь = ВыбранноеЗначение;
	КонецЕсли;

	Возврат (Ответ);
КонецФункции

&НаСервере
Функция ОбработкаВыбораПредприятие(ВыбранноеЗначение)

// Сначала проверим не дублируется ли выбранное значение
//-------------------------------------------------------------------------------------------------
	Отбор = Новый Структура("Подразделение",ВыбранноеЗначение);
	НайденныеСтроки = Объект.Подразделения.НайтиСтроки(Отбор);

	Если (НайденныеСтроки.Количество() > 0) Тогда
		Возврат ("Выбранное подразделение уже присутствует в списке доступных");
	КонецЕсли;

// Выбранный элемент не дублируется явно
// Однако выбранный элемент может входить в иерархию другого присутствующего в списке элемента
//-------------------------------------------------------------------------------------------------
	Для Каждого ТекСтрока Из Объект.Подразделения Цикл
		Если (ВыбранноеЗначение.ПринадлежитЭлементу(ТекСтрока.Подразделение)) Тогда
			ТекстСообщения = "Выбранное подразделение находится в группе [" + СокрЛП(ТекСтрока.Подразделение);
			ТекстСообщения = ТекстСообщения + "], к которой у пользователя уже имеется доступ";
			Возврат (ТекстСообщения);
		КонецЕсли;
	КонецЦикла;

// Выбранный элемент не входит ни в какую присутствующую в списке иерархию
// Однако выбранный элемент может сам являться суперэлементом для каких-либо элементов списка
// Получим все элементы из ТЧ "Подразделения", которые входят в иерархию выбранного элемента
//-------------------------------------------------------------------------------------------------
	МассивУдаления = Новый Массив;
	ТекстУдаления = "";
	Ответ = "";

	Для Каждого ТекСтрока Из Объект.Подразделения Цикл
		Если (ТекСтрока.Подразделение.ПринадлежитЭлементу(ВыбранноеЗначение)) Тогда
			ТекстУдаления = ТекстУдаления + ?(ЗначениеЗаполнено(ТекстУдаления),Символы.ПС,"");
			ТекстУдаления = ТекстУдаления + СокрЛП(ТекСтрока.Подразделение.НаименованиеПолное);
			МассивУдаления.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;

// Если в МассивеУдаления есть элементы, значит они входят в иерархию выбранного подразделения
// Эти элементы необходимо удалить. Известим об этом пользователя
//-------------------------------------------------------------------------------------------------
	Если (МассивУдаления.Количество() > 0) Тогда
		Для Каждого ТекСтрока Из МассивУдаления Цикл
			Объект.Подразделения.Удалить(ТекСтрока);
		КонецЦикла;

		Ответ = "Следующие подразделения были удалены из списка доступных, т.к. ";
		Ответ = Ответ + "выбранный элемент является вышестоящим для них:";
		Ответ = Ответ + Символы.ПС + СокрЛП(ТекстУдаления);
	КонецЕсли;

// Все проверки пройдены успешно
//-------------------------------------------------------------------------------------------------
	НовСтрока = Объект.Подразделения.Добавить();
	НовСтрока.Подразделение = ВыбранноеЗначение;
	ЭтаФорма.Модифицированность = Истина;
	Возврат (Ответ);
КонецФункции

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ПользователиПередНачаломДобавления(Элемент,Отказ,Копирование,Родитель,Группа,Параметр)

// Откроем справочник для выбора добавляемых значений
//-------------------------------------------------------------------------------------------------
	СтрПараметры = Новый Структура("ЗакрыватьПриВыборе",Ложь);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",СтрПараметры,ЭтаФорма);
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПередНачаломДобавления(Элемент,Отказ,Копирование,Родитель,Группа,Параметр)

// Откроем формы для подбора подразделений
//-------------------------------------------------------------------------------------------------
	СтрПараметры = Новый Структура("ЗакрыватьПриВыборе",Ложь);
	ОткрытьФорму("Справочник.Предприятие.ФормаВыбораГруппы",СтрПараметры,ЭтаФорма);
	Отказ = Истина;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ПанелиПередНачаломДобавления(Элемент,Отказ,Копирование,Родитель,Группа,Параметр)

// Создадим новый подчиненный элемент
//-------------------------------------------------------------------------------------------------
	ЗначенияЗаполнения = Новый Структура("Родитель",Объект.Ссылка);
	СтрПараметры = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
	ОткрытьФорму("Справочник.КонтактЦентры.ФормаОбъекта",СтрПараметры,ЭтаФорма);
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПанельПросмотр(Команда)

// Откроем панель для предварительного просмотра
//-------------------------------------------------------------------------------------------------
	СтрПараметры = Новый Структура("КонтактЦентр",Объект.Ссылка);
	ОткрытьФорму("Обработка.КонсольКонтактЦентра.Форма.ФормаБыстрогоВызова",СтрПараметры);
КонецПроцедуры
